app/Http/Controllers/Auth/RegisterController.php

insert into "users" ("name", "email", "password", "updated_at", "created_at") values ('tg bot777', 'valerik22wdwdw2@gmail.com', '$2y$12$kuzHvYsJm312umNl7r093ucFyS10HamTs745OAaLSvdgFtUAXq4JG', '2025-05-17 06:10:06', '2025-05-17 06:10:06') returning "id"
---
    public function register(Request $request)
    {
        $validated = $request->validate([
            'name' => 'required',
            'email' => 'required|email|unique:users,email',
            'password' => 'required|min:6|confirmed',
        ]);

        User::create([
            'name' => $validated['name'],
            'email' => $validated['email'],
            'password' => Hash::make($validated['password']),
        ]);