app/Services/ApplicationService.php

insert into "active_requests" ("user_id", "service_name", "phone", "description", "updated_at", "created_at") values (49, 'electrical', '9248298233', 'cccc', '2025-06-03 06:16:26', '2025-06-03 06:16:26') returning "id"
---
    public function store(array $validated): void
    {
        ActiveRequest::create([
            'user_id' => $validated['user_id'],
            'service_name' => $validated['service_name'],
            'phone' => $validated['phone'],
            'description' => $validated['description'],
        ]);

select * from "active_requests" where "active_requests"."user_id" = 2 and "active_requests"."user_id" is not null and "status" = 'active'
select * from "active_requests" where "active_requests"."user_id" = 2 and "active_requests"."user_id" is not null and "status" = 'finished'
---
    public function index()
    {
        $applications = Auth::user()->activeRequests()->where('status', 'active')->get();
        $finishedApplications = Auth::user()->activeRequests()->where('status', 'finished')->get();