app/Services/RightService.php

    public function AddRight($userId, $rightName)
    {
        $user = User::findOrFail($userId);
        $right = Right::where('name', $rightName)->firstOrFail();

        if (!$user->rights->contains('id', $right->id)) {
            $user->rights()->attach([$right->id]);
---
select * from "users" where "users"."id" = '1' limit 1
select * from "rights" where "name" = 'can_create_apppllication' limit 1
insert into "user_right" ("right_id", "user_id") values (20, 1)

    public function rightFinish($user, $right)
    {
        $user = User::findOrFail($user);
---
select * from "users" where "users"."id" = '2' limit 1