app/Http/Controllers/Right/RightController.php

    public function search(Request $request) // пененести толстого в сервис
    {
        if (User::where('id', $request->input('id'))->exists()) {
            $user = User::findOrFail($request->input('id'));
---
select * from "users" where "users"."id" = '1' limit 1
select exists(select * from "users" where "id" = '1') as "exists"

    public function rightFinish($user, $right) // пененести толстого в сервис
    {
        $user = User::findOrFail($user);
        $right = Right::findOrFail($right);
        $user->rights()->detach($right->id);
---
select * from "users" where "users"."id" = '2' limit 1
select * from "rights" where "rights"."id" = '20' limit 1
delete from "user_right" where "user_right"."user_id" = 2 and "user_right"."right_id" in (20)