app/Http/Controllers/application/ApplicationController.php

insert into "active_requests" ("user_id", "service_name", "phone", "description", "updated_at", "created_at") values (48, 'electrical', '9248298233', 'test3', '2025-05-24 14:00:03', '2025-05-24 14:00:03') returning "id"
---
    public function store(Request $request)
    {
        $validated = $request->validate([
            'service_name' => 'required',
            'phone' => 'required|regex:/^[\d\+\-\(\)\s]+$/|min:6|max:20',
            'description' => 'required',
        ]);

        ActiveRequest::create([
            'user_id' => Auth::id(),
            'service_name' => $validated['service_name'],
            'phone' => $validated['phone'],
            'description' => $validated['description'],
        ]);