app/Http/Controllers/UserControllers/UserController.php

    public function CreateUser(Request $request)
    {
        $validated = $request->validate([
            'name' => 'required',
            'email' => 'required|email|unique:users,email',
            'password' => 'required|min:6',
        ]);

        User::create([
            'name' => $validated['name'],
            'email' => $validated['email'],
            'password' => Hash::make($validated['password']),
        ]);
---
insert into "users" ("name", "email", "password", "updated_at", "created_at") values ('vezeleeeee', 'valerik2eeee2@gmail.com', '$2y$12$BQMKCed9ln2NXVjOz9NPkeJTGfUk1HxPj5m8VPg2w8aH/4bcpknem', '2025-05-12 10:23:53', '2025-05-12 10:23:53') returning "id"

    public function getAllUsers()
    {
        $users = User::all();
---
select * from "users"

    public function updateUser(Request $request, $id)
    {
        $validated = $request->validate([
            'name' => 'required',
            'email' => 'required|email|unique:users,email,' . $id,
        ]);

        $user = User::findOrFail($id);
        $user->update($validated);
---
select * from "users" where "users"."id" = '37' limit 1
update "users" set "name" = 'vezeleeeвцee', "email" = 'wfwwfwfe2@gmail.com', "updated_at" = '2025-05-13 14:53:55' where "id" = 37

    public function UpdateFormUser($id)
    {
        $user = User::findOrFail($id);
---
select * from "users" where "users"."id" = '30' limit 1